{
  "scenarios": [
    "Your parents catch you talking to a person of the opposite gender. What is your explanation?",
    "You accidentally send a screenshot of a chat to the person you were talking about. How do you recover?",
    "The rishta (matchmaking) photo looks nothing like you. What is the caption?",
    "You are at a wedding and the paneer finishes. What do you do?",
    "Traffic police catches you without a license. What is your excuse?",
    "You forget to touch an elder's feet. What curse do they mutter?",
    "Your mom finds the bill for the \"drinks\" you had with friends. What did you actually buy?",
    "You try to explain \"Netflix and Chill\" to your Dad. What do you say it means?",
    "The auto driver agrees to go by the meter. What is the catch?",
    "You get added to a family WhatsApp group. What is the first message you see?",
    "Your maid takes a leave on the day of your house party. What is her reason?",
    "You are caught sleeping in the office post-lunch. What were you dreaming about?",
    "A random uncle gives you unsolicited advice on the metro. What is it?",
    "You wear ripped jeans in front of your Dadi. What does she offer you?",
    "You order \"medium spicy\" and it burns a hole in your tongue. What do you tell the waiter?",
    "Your friend says \"I'll pay you back tomorrow.\" When do you actually get the money?",
    "You walk into a glass door at a mall. How do you pretend it was intentional?",
    "The neighbor asks for your Wi-Fi password. What is the password?",
    "You are asked to sing at a family gathering. What song do you choose to embarrass everyone?",
    "You find 500 rupees in an old jeans pocket. What do you spend it on immediately?",
    "Your boss asks you to work on the weekend. What family emergency do you invent?",
    "You accidentally call your teacher \"Mummy\". How do you fix it?",
    "Someone cuts the line at the ticket counter. What passive-aggressive comment do you make?",
    "You bring a non-Indian friend to a street food stall. What happens to them?",
    "Your crush asks about your salary. What vague answer do you give?",
    "You are on a diet but someone offers you Gulab Jamun. What is your logic for eating it?",
    "The power goes out during the India vs Pakistan match. Who do you blame?",
    "You try to return an item without a bill. What story do you cook up?",
    "Your parents compare you to Sharma Ji's son. What is Sharma Ji's son actually doing?",
    "You get a spam call offering a loan. How do you mess with them?"
  ],
  "responses": [
    "Sharma Ji ka beta.",
    "One plate Pani Puri, extra teekha.",
    "Link your Aadhaar card first.",
    "Bas 2 minute mein pahunch raha hoon.",
    "Because the astrologer said so.",
    "My parents' expectations.",
    "A WhatsApp forward from 2015.",
    "Free dhaniya with vegetables.",
    "Judgemental Aunties.",
    "Engineering degree holder, working in sales.",
    "I swear on my mother.",
    "Tu jaanta nahi mera baap kaun hai.",
    "Chalta hai attitude.",
    "Arranged marriage proposals.",
    "Discount maangna mera janmasiddh adhikar hai.",
    "Beta, tumse na ho payega.",
    "Asking for extra chutney.",
    "Traffic at Silk Board.",
    "Server down.",
    "Lunch break ke baad aana.",
    "Did you eat?",
    "Looking for a fair and lovely bride.",
    "Bob and vagene.",
    "Scammers from Jamtara.",
    "Desi Daru.",
    "Butter Chicken and Naan.",
    "Sola Somvar ka vrat.",
    "Nazar na lage.",
    "Shagun ke 101 rupay.",
    "An expired coupon code.",
    "My diet starts tomorrow.",
    "Only here for the free food.",
    "Bhai, land kara de.",
    "Ye bik gayi hai gormint.",
    "Hello friends, chai pi lo.",
    "Jugaad technology.",
    "Putting a cover on the TV remote.",
    "Storing sewing kit in a cookie tin.",
    "Asking 'Good name?'",
    "Sending 'Good Morning' GIFs.",
    "Eating with hands.",
    "Head wobble.",
    "Calling everyone Bhaiya/Didi.",
    "Bargaining for 5 rupees.",
    "Asking for the bill to be split 17 ways.",
    "Pretending to be on a call to avoid people.",
    "Saying 'On the way' while in the shower.",
    "Blaming the traffic.",
    "Using a plastic bag to store other plastic bags.",
    "Turning off the fan to wake someone up.",
    "Asking 'Aur batao' when conversation dies.",
    "Checking the price tag before the product.",
    "Taking extra ketchup sachets home.",
    "Drinking water from a steel glass without touching lips.",
    "Slapping the remote to make it work.",
    "Putting water in the shampoo bottle to get the last drop.",
    "Asking 'Is it veg?' at a steakhouse.",
    "Judging people based on their marks.",
    "Comparing salary packages.",
    "Saying 'Nice pic dear' on LinkedIn."
  ]
}
